app/controllers/comments_controller.rb

  def create
    @post=Post.find(params[:post_id])
    @comment =@post.comments.new(comment_params)
    @comment.author_id = current_user.id
    @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "ahmed"], ["body", "mabroooook"], ["post_id", 2], ["created_at", "2019-10-01 18:04:44.477042"], ["updated_at", "2019-10-01 18:04:44.477042"]]