app/controllers/posts_controller.rb

    def create
       # render plain:params[:post].inspect
       #@post = Post.new(post_params)
       @post=Post.new(post_params)
       @post.author_id = current_user.id
      if(@post.save)
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`, `author_id`) VALUES ('vdsvsdvsdv', 'dvsdvsdvsdv', '2020-05-31 18:06:46.776404', '2020-05-31 18:06:46.776404', 1)